% 程序描述：Func_Bredth_first_search
% Input: 一个正常排序1*16序列A
% Output:四种按照不同规则排序的1*16序列B1,B2,B3,B4
% by whp 2018.5.14-OK
%% 子函数 Bredth_first_search
function B=Func_Reverse_Bredth_first_search(A,num)
% B1=[1,2,5,3,6,9,4,7,10,13,8,11,14,12,15,16];
% B2=[4,3,8,2,7,12,1,6,11,16,5,10,15,9,14,13];
% B3=[13,14,9,15,10,5,16,11,6,1,12,7,2,8,3,4];
% B4=[16,15,12,14,11,8,13,10,7,4,9,6,3,5,2,1];
B1=[1,2,4,7,3,5,8,11,6,9,12,14,10,13,15,16];
B2=[7,4,2,1,11,8,5,3,14,12,9,6,16,15,13,10];
B3=[10,13,15,16,6,9,12,14,3,5,8,11,1,2,4,7];
B4=[16,15,13,10,14,12,9,6,11,8,5,3,7,4,2,1];
switch num
    case 0
        for i=1:16
            B(i)=A(B1(i));
        end
    case 1
        for i=1:16
            B(i)=A(B2(i));
        end
    case 2
        for i=1:16
            B(i)=A(B3(i));
        end
    case 3
        for i=1:16
            B(i)=A(B4(i));
        end
end
end